# 시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
# 1 초	1024 MB	667	491	461	75.947%
# 문제
# 월간 향유회는 여러 명의 출제진과 검수진이 본인이 가능한 일정에 맞추어 문제를 만들고 검수하는 형태로 운영이 되고 있다.

# 출제진은 아이디어가 떠오를 때마다 문제 포럼에 본인의 아이디어를 기록해 두고, 매달 대회가 있을 때마다 문제 포럼에서 몇 개의 문제를 선제하여 사용한다. 
# 선제는 보통 이전 달 대회가 끝난 직후 이루어지며, 선제된 문제에 대한 검수 과정을 월말까지 거치게 된다.

# 월간 향유회의 운영 방식을 알았으니 이제 아래의 간단한 문제를 풀어 보도록 하자.

# 입력으로 
# $Q$개의 이벤트가 시간 순서대로 주어지며, 다음 2가지 형태 중 하나로 주어진다.

# 1 x: 출제진이 
# $x$개의 문제를 문제 포럼에 추가한다.
# 2 y: 대회가 열려 
# $y$개의 문제를 사용한다.
# 2번 이벤트에서 
# $y$개의 문제를 사용하려고 했지만 문제 포럼에 사용되지 않은 문제가 
# $y$개 미만인 경우 월간 향유회는 즉시 해산을 선언하게 된다.

# 처음에는 문제 포럼에 어떠한 문제도 존재하지 않았다고 할 때, 이벤트가 모두 종료된 후 월간 향유회가 해산을 피할 수 있었는지 구해보자.

# 입력
# 첫 번째 줄에 이벤트의 개수 
# $Q$가 주어진다. (
# $1 \le Q \le 10$)

# 두 번째 줄부터 
# $Q$개의 줄에 걸쳐 이벤트의 내용이 주어진다. (
# $1 \le x, y \le 10$)

# 출력
# 월간 향유회가 도중에 해산을 선언하였다면 Adios를 출력한다. 그렇지 않았다면 See you next month를 출력한다.

# 예제 입력 1 
# 2
# 1 10
# 2 5
# 예제 출력 1 
# See you next month
# 예제 입력 2 
# 2
# 1 5
# 2 10
# 예제 출력 2 
# Adios
# 예제 입력 3 
# 3
# 1 3
# 2 6
# 1 3
# 예제 출력 3 
# Adios


Q = int(input())
save = 0
x = 0
y = 0
ans = 0
for i in range(0 , Q):
    type, a = map(int, input().split())
    if type == 1:
        save += a
    else:
        if type == 2:
            save -= a
    if save < 0 and ans != -1:
        ans = -1
        


if ans  != -1:
    print("See you next month", end = '')
else:
    print("Adios", end = '')