
# 당신은 폴리매스 왕국의 암호 개발자 친구로부터 개발을 요청받아 암호 제작을 돕기로 했습니다.

# 친구가 고안한 암호는 다음과 같이 작동합니다. 1에서 9까지의 숫자로 이루어진 문자열 $A$와 $B$가 있을 때, 이 둘이 공통으로 가지는 부분 문자열 중 길이가 $K$인 것이 비밀번호가 됩니다. (부분문자열의 정의는 다음 페이지에 있습니다.) 예를 들어, $A=1122$, $B=1223$, $K=2$라면, 비밀번호로 가능한 문자열은 $12$, $22$입니다.

# 친구는 문자열 $A$와 암호 $P$를 이미 정해 놓았고, $B$를 정하려고 합니다. 비밀번호로 가능한 문자열이 여러 개일 경우 보안이 약해질 수 있기 때문에, $P$ 이외에 다른 비밀번호가 나와서는 안 됩니다. 친구를 도와 이 조건을 모두 만족하는 $B$를 아무거나 하나 찾아 주도록 합시다. 문자열이 너무 길면 힘들기 때문에, $B$의 길이는 100 이하여야 합니다.

# 조건을 만족하는 문자열 $B$가 항상 존재함이 보장됩니다.

# 입력
# 첫 줄에는 문자열 $A$가 주어집니다. 둘째 줄에는 비밀번호 $P$가 주어집니다.

# 출력
#  $P$가 유일한 비밀번호가 되게 하는 $B$를 아무거나 출력합니다.

# 제한
#  $1 \le |P| \le |A| \le 100$ (단, $|S|$는 $S$의 길이를 나타냅니다.)
#  $A$는 $P$를 부분 문자열로 가집니다.
#  $A$, $P$의 모든 문자는 1 이상 9 이하의 숫자입니다.
#  $K=|P|$ 
#  $|B| \le 100$ 
# 서브태스크
# 번호	배점	제한
# 1	100	
# 추가 제한 조건이 없습니다.
# 예제 입력 1 
# 11299
# 29
# 예제 출력 1 
# 3298
# 예제 입력 2 
# 12345678
# 234
# 예제 출력 2 
# 234234
# 노트
#  $B$가 $A$의 부분문자열이라는 것은 $A$의 왼쪽 끝과 오른쪽 끝에서 0개 이상의 문자를 제거해서 $B$를 만들 수 있음을 말합니다. 예를 들어 "123123"의 부분문자열로는 "123", "2312", "3", "123123" 등이 있지만, "11", "212" 등은 부분문자열이 아닙니다.



a = input()

b = input()

print(b)

